In [1]:
import sys
print(sys.version)
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

3.5.2 |Anaconda 4.2.0 (64-bit)| (default, Jul  5 2016, 11:41:13) [MSC v.1900 64 bit (AMD64)]

In [2]:
df = pd.read_csv('../pallabi.csv')
df.head()

C:\Program Files\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2717: DtypeWarning: Columns (5) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,NAME,ACCOUNT_NO,METER_NO,ADDRESS,ZONE,BLOCK,ROUTE,LOAD,TARIFF,METER_STATUS,MONTH,YEAR,UNIT
0,HEAD MASTER KALSHI HIGH S,11313911,0000830099,11 E/DAG NO 3170 MIRPUR DHAKA,PLAF,110,10.0,2.0,D,Single,5,1999,1755.0
1,HEAD MASTER KALSHI HIGH S,11313911,0000830099,11 E/DAG NO 3170 MIRPUR DHAKA,PLAF,110,10.0,2.0,D,Single,6,1999,1615.0
2,HEAD MASTER KALSHI HIGH S,11313911,0000830099,11 E/DAG NO 3170 MIRPUR DHAKA,PLAF,110,10.0,2.0,D,Single,7,1999,375.0
3,HEAD MASTER KALSHI HIGH S,11313911,0000830099,11 E/DAG NO 3170 MIRPUR DHAKA,PLAF,110,10.0,2.0,D,Single,8,1999,375.0
4,HEAD MASTER KALSHI HIGH S,11313911,0000830099,11 E/DAG NO 3170 MIRPUR DHAKA,PLAF,110,10.0,2.0,D,Single,9,1999,350.0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4343235 entries, 0 to 4343234
Data columns (total 13 columns):
NAME            object
ACCOUNT_NO      int64
METER_NO        object
ADDRESS         object
ZONE            object
BLOCK           object
ROUTE           float64
LOAD            float64
TARIFF          object
METER_STATUS    object
MONTH           int64
YEAR            int64
UNIT            float64
dtypes: float64(3), int64(3), object(7)
memory usage: 430.8+ MB

In [4]:

df.isnull().sum()

NAME              0
ACCOUNT_NO        0
METER_NO        591
ADDRESS           0
ZONE              0
BLOCK             0
ROUTE             0
LOAD              0
TARIFF            0
METER_STATUS      0
MONTH             0
YEAR              0
UNIT              0
dtype: int64

In [5]:
df = df.dropna()
df.isnull().sum()

NAME            0
ACCOUNT_NO      0
METER_NO        0
ADDRESS         0
ZONE            0
BLOCK           0
ROUTE           0
LOAD            0
TARIFF          0
METER_STATUS    0
MONTH           0
YEAR            0
UNIT            0
dtype: int64

In [6]:
df.to_csv('../pallabi.csv',index=False)
df.tail()

,NAME,ACCOUNT_NO,METER_NO,ADDRESS,ZONE,BLOCK,ROUTE,LOAD,TARIFF,METER_STATUS,MONTH,YEAR,UNIT
4343230,MRS. KAMRUN NAHAR,31511375,66188,"House/Flat # 25, Road # 3, Block # E, Section ...",PLKL,352,940.0,7.0,A,child,8,2012,223.0
4343231,MRS. KAMRUN NAHAR,31511375,66188,"House/Flat # 25, Road # 3, Block # E, Section ...",PLKL,352,940.0,7.0,A,child,9,2012,127.0
4343232,MRS. KAMRUN NAHAR,31511375,66188,"House/Flat # 25, Road # 3, Block # E, Section ...",PLKL,352,940.0,7.0,A,child,10,2012,121.0
4343233,MRS. KAMRUN NAHAR,31511375,66188,"House/Flat # 25, Road # 3, Block # E, Section ...",PLKL,352,940.0,7.0,A,child,11,2012,97.0
4343234,MRS. KAMRUN NAHAR,31511375,66188,"House/Flat # 25, Road # 3, Block # E, Section ...",PLKL,352,940.0,7.0,A,child,12,2012,90.0

In [7]:
neg_unit_rows = df.loc[df['UNIT'] <0]

In [8]:
neg_unit_rows.head()

,NAME,ACCOUNT_NO,METER_NO,ADDRESS,ZONE,BLOCK,ROUTE,LOAD,TARIFF,METER_STATUS,MONTH,YEAR,UNIT
211,Md. Foaz Uddin Madbar (Chaiman),13006747,55001205,"House/Flat # Jame Mosjid, Road # Kalsi Road, B...",PLAF,110,20.0,11.0,D,check,4,2013,-1.0
7453,MRS. TOFA AKTHER MATIN,11516230,03643,"11/E, RD-01, H-01, PALLABI. DHAKA",PLAF,110,830.0,3.0,E,check,8,2008,-1199.0
7499,MRS. TOFA AKTHER MATIN,11516230,03643,"11/E, RD-01, H-01, PALLABI. DHAKA",PLAF,110,830.0,3.0,E,check,6,2012,-179.0
7501,MRS. TOFA AKTHER MATIN,11516230,03643,"11/E, RD-01, H-01, PALLABI. DHAKA",PLAF,110,830.0,3.0,E,check,8,2012,-95.0
11990,MRS. SOFIA BEGUM,11521339,8125504,"11/E, RD-2, H-38, PALLABI, DHAKA",PLAF,110,1160.0,3.0,A,Check,8,2009,-507.0

In [9]:
neg_unit_rows.count()

NAME            11818
ACCOUNT_NO      11818
METER_NO        11818
ADDRESS         11818
ZONE            11818
BLOCK           11818
ROUTE           11818
LOAD            11818
TARIFF          11818
METER_STATUS    11818
MONTH           11818
YEAR            11818
UNIT            11818
dtype: int64

In [10]:
def IMPUTE_UNIT(x):
    if x.UNIT < 0:
        return 0
    else:
        return x.UNIT
def mean_calculate(acc, year):
    return "(ACCOUNT_NO =="+ str(acc)+") & (YEAR =="+str(year)+") & (UNIT > 0)"

def IMPUTE_UNIT_WITH_MEAN(x):
    if x.UNIT < 0:
        acc = x.ACCOUNT_NO
        year = x.YEAR
        mean = 0
        mean = df.query(mean_calculate(acc,year)).UNIT.mean()
#         try:

#             mean = df.query('(ACCOUNT_NO == acc) & (YEAR == year) & (UNIT > 0)').UNIT.mean()
#         except :
#             print('{0} {1} {2}'.format(acc,year, mean))

        return mean
    else:
        return x.UNIT
mean_calculate(12,13)

'(ACCOUNT_NO ==12) & (YEAR ==13) & (UNIT > 0)'

In [11]:
df['IMPUTE_UNIT'] = df.apply( IMPUTE_UNIT_WITH_MEAN, axis=1)

In [12]:
df.IMPUTE_UNIT.lt(0).sum()

0

In [13]:
df.UNIT.lt(1).sum()

144719

In [14]:
df.IMPUTE_UNIT.lt(-1).sum()

0

In [15]:
df.UNIT.lt(-1).sum()

11607

In [16]:
df.to_csv('../pallabi.csv',index=False)